Update MESSAGE_FLOW.md
